# Processing Dataframes

## This notebook contains notes on basic processing on Dataframes such as merging, handling duplicates, concatenation and a lot many.

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

### Merging two dataframes

#### The merge on multiple dataframes occurs based on the common columns. Hence presence of at least one common column with some common values across the merging dataframes is necessary.

In [31]:
dframe1 = DataFrame({'Countries':['India','Pakistan','China','Russia','Brazil','Italy','Germany','France'],
                      'Code':[0,1,4,2,1,4,0,1]})
dframe1

   Code Countries
0     0     India
1     1  Pakistan
2     4     China
3     2    Russia
4     1    Brazil
5     4     Italy
6     0   Germany
7     1    France

In [32]:
dframe2 = DataFrame({'Code':[0,1,2,4],'Status':['A','B','C','D']})
dframe2

   Code Status
0     0      A
1     1      B
2     2      C
3     4      D

In [33]:
dframe0 = pd.merge(dframe1,dframe2)
dframe0

   Code Countries Status
0     0     India      A
1     0   Germany      A
2     1  Pakistan      B
3     1    Brazil      B
4     1    France      B
5     4     China      D
6     4     Italy      D
7     2    Russia      C

 #### Here, you can see that the two dataframes dframe1 and dframe2 are created using a dictionary. The dframe1 describes the mapping of columns: code and country, while the dframe2 describes the mapping of columns: code and status. Hence when merged, the final dataframe describes all the columns based on common column between the two dataframes, namely: 'Code'.

#### You can also mention based on what column you want the merge to happen:

In [34]:
pd.merge(dframe1,dframe2,on="Code")

   Code Countries Status
0     0     India      A
1     0   Germany      A
2     1  Pakistan      B
3     1    Brazil      B
4     1    France      B
5     4     China      D
6     4     Italy      D
7     2    Russia      C

#### You can take a union of the merging dataframes using:

In [35]:
pd.merge(dframe1,dframe2,how="outer")

   Code Countries Status
0     0     India      A
1     0   Germany      A
2     1  Pakistan      B
3     1    Brazil      B
4     1    France      B
5     4     China      D
6     4     Italy      D
7     2    Russia      C

#### Merging dataframes based on two columns

In [36]:
dframe1 = DataFrame({'key0':[1,2,3,4],'key1':['A','B','C','D'],'values1':['Apple','Mango','Banana','Mango']})
dframe1

   key0 key1 values1
0     1    A   Apple
1     2    B   Mango
2     3    C  Banana
3     4    D   Mango

In [37]:
dframe2 = DataFrame({'key0':[0,1,2,5],'key1':['B','F','D','A'],'values2':['Grapes','Banana','Apple','Grapes']})
dframe2

   key0 key1 values2
0     0    B  Grapes
1     1    F  Banana
2     2    D   Apple
3     5    A  Grapes

In [38]:
pd.merge(dframe1,dframe2,on=['key0','key1'],how='outer')

   key0 key1 values1 values2
0     1    A   Apple     NaN
1     2    B   Mango     NaN
2     3    C  Banana     NaN
3     4    D   Mango     NaN
4     0    B     NaN  Grapes
5     1    F     NaN  Banana
6     2    D     NaN   Apple
7     5    A     NaN  Grapes

### Concatenation of Series' and Dataframes

In [51]:
series1 = Series(['A','B','C','D'])
series2 = Series(['E','F','G','H'])
pd.concat([series1,series2])

0    A
1    B
2    C
3    D
0    E
1    F
2    G
3    H
dtype: object

In [52]:
pd.concat([series1,series2],axis=1)

   0  1
0  A  E
1  B  F
2  C  G
3  D  H

 #### Add labels to concatenating series'

In [53]:
pd.concat([series1,series2],keys=['ser1','ser2'])

ser1  0    A
      1    B
      2    C
      3    D
ser2  0    E
      1    F
      2    G
      3    H
dtype: object

In [54]:
pd.concat([series1,series2],keys=['ser1','ser2'],axis=1)

  ser1 ser2
0    A    E
1    B    F
2    C    G
3    D    H

In [55]:
dframe1 = DataFrame(np.random.randn(4,4),index=[0,1,2,3],columns=['A','B','C','D'])
dframe1

          A         B         C         D
0  0.270177 -0.308539  1.279424  0.442702
1 -1.321187  0.407407  0.166790 -0.175279
2 -0.130915 -1.176362  1.117549 -0.987583
3 -0.197647 -0.298042  0.250969  0.512615

In [56]:
dframe2 = DataFrame(np.random.randn(4,4),index=[0,1,2,3],columns=['A','B','C','D'])
dframe2

          A         B         C         D
0 -1.443341  0.153233  2.392637  0.590080
1 -1.740027 -0.237718 -0.149840 -0.092149
2 -0.770921 -0.188387  0.542227  1.550774
3  0.165801 -0.967498  0.774702 -0.958168

In [57]:
 pd.concat([dframe1,dframe2],ignore_index=True)

          A         B         C         D
0  0.270177 -0.308539  1.279424  0.442702
1 -1.321187  0.407407  0.166790 -0.175279
2 -0.130915 -1.176362  1.117549 -0.987583
3 -0.197647 -0.298042  0.250969  0.512615
4 -1.443341  0.153233  2.392637  0.590080
5 -1.740027 -0.237718 -0.149840 -0.092149
6 -0.770921 -0.188387  0.542227  1.550774
7  0.165801 -0.967498  0.774702 -0.958168

#### The ignore_index parameter ensures consecutive indexing of concatenating rows instead of following already provided indices.

### Combining Dataframes

In [59]:
nan = np.nan
dframe1 = DataFrame([[0,nan,2,nan],[4,nan,6,nan],[8,nan,10,nan]])
dframe1

   0   1   2   3
0  0 NaN   2 NaN
1  4 NaN   6 NaN
2  8 NaN  10 NaN

In [62]:
dframe2 = DataFrame([[nan,1,nan,3],[nan,5,nan,7],[nan,9,nan,11]])
dframe2

    0  1   2   3
0 NaN  1 NaN   3
1 NaN  5 NaN   7
2 NaN  9 NaN  11

In [63]:
dframe1.combine_first(dframe2)

   0    1   2     3
0  0  1.0   2   3.0
1  4  5.0   6   7.0
2  8  9.0  10  11.0

#### Here the combine_first method fills in corresponding values from dframe2 wherever there is a "nan" in dframe1. Alternatively, we could have done this using list comprehension or where() method from numpy library, but combine_first method does the job requiring shorter code length.

### Reshaping Dataframes

In [72]:
dframe1 = DataFrame({'Countries':['India','Pakistan','China','Ireland','Australia',np.nan],
                     'Capital':['New Delhi','Islamabad','Beijing','Dublin','Canberra','Kuala Lumpur']})
dframe1

        Capital  Countries
0     New Delhi      India
1     Islamabad   Pakistan
2       Beijing      China
3        Dublin    Ireland
4      Canberra  Australia
5  Kuala Lumpur        NaN

In [73]:
dframe1.stack()

0  Capital         New Delhi
   Countries           India
1  Capital         Islamabad
   Countries        Pakistan
2  Capital           Beijing
   Countries           China
3  Capital            Dublin
   Countries         Ireland
4  Capital          Canberra
   Countries       Australia
5  Capital      Kuala Lumpur
dtype: object

#### As you can check, the Countries value for Capital 'Kuala Lumpur' was dropped when stacked since it had a nan value. If you want to retain the nan value, pass parameter dropna equal to false.

In [74]:
dframe1.stack(dropna=False)

0  Capital         New Delhi
   Countries           India
1  Capital         Islamabad
   Countries        Pakistan
2  Capital           Beijing
   Countries           China
3  Capital            Dublin
   Countries         Ireland
4  Capital          Canberra
   Countries       Australia
5  Capital      Kuala Lumpur
   Countries             NaN
dtype: object

### Handling Duplicates in a Dataframe

In [84]:
dframe1 = DataFrame({'Alphabets':['a','b','a','b','c','a','c','b','a','c'],
                     'Numbers':[100,200,100,400,500,600,700,200,300,700]})
dframe1

  Alphabets  Numbers
0         a      100
1         b      200
2         a      100
3         b      400
4         c      500
5         a      600
6         c      700
7         b      200
8         a      300
9         c      700

In [85]:
dframe1.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

#### The dupilcated method returns boolean value for each rows stating whether they are duplicates or not. To drop duplicates, do as follows:

In [86]:
dframe1.drop_duplicates()

  Alphabets  Numbers
0         a      100
1         b      200
3         b      400
4         c      500
5         a      600
6         c      700
8         a      300

### Replacing values

In [90]:
series = Series([100,200,300,400,500,100,760,300,200,1000,100])
series.replace(100,1)

0        1
1      200
2      300
3      400
4      500
5        1
6      760
7      300
8      200
9     1000
10       1
dtype: int64

#### Replacing multiple values

In [91]:
series.replace([100,200,300,400,500,1000],[1,2,3,4,5,10])

0       1
1       2
2       3
3       4
4       5
5       1
6     760
7       3
8       2
9      10
10      1
dtype: int64

### Renaming indices

In [92]:
dframe = DataFrame(['a','b','c','d'],index=['austria','belgium','czech','denmark'])
dframe

         0
austria  a
belgium  b
czech    c
denmark  d

In [93]:
 dframe.rename({'austria':'australia','czech':'czech republic'})

                0
australia       a
belgium         b
czech republic  c
denmark         d

 ### Binning

In [95]:
values = Series(np.array([1203,2040,1100,605,9129,6054,5093,7096,7090,1020,4300,2304,5403,6050,8070,5404,7012]))
values

0     1203
1     2040
2     1100
3      605
4     9129
5     6054
6     5093
7     7096
8     7090
9     1020
10    4300
11    2304
12    5403
13    6050
14    8070
15    5404
16    7012
dtype: int32

#### Find the minimum and maximum values and create bins accordingly

In [96]:
values.min()

605

In [97]:
values.max()

9129

In [100]:
bins = [0000,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000]
categories_object = pd.cut(values,bins)

In [103]:
categories_object.dtype

CategoricalDtype(categories=[(0, 1000], (1000, 2000], (2000, 3000], (3000, 4000], (4000, 5000], (5000, 6000], (6000, 7000], (7000, 8000], (8000, 9000], (9000, 10000]]
              ordered=True)

In [102]:
pd.value_counts(categories_object)

(7000, 8000]     3
(5000, 6000]     3
(1000, 2000]     3
(6000, 7000]     2
(2000, 3000]     2
(9000, 10000]    1
(8000, 9000]     1
(4000, 5000]     1
(0, 1000]        1
(3000, 4000]     0
dtype: int64

#### The pandas cut method distributes the data from values array into ranges bounded by values in bins array. The value_counts method simply returns the count of values in each category in categories_object.

### Permutation and Shuffling in Dataframes

#### Let's say we want to shuffle a deck of cards. The cards array contain values of the labels on card.

In [114]:
cards = np.array([0,1,2,3,4,5,6,7,8,9,'J','Q','K','A'])
shuffler = np.random.permutation(14)
shuffler

array([12, 13,  1, 11, 10,  4,  5,  6,  3,  2,  9,  0,  7,  8])

In [115]:
cards = Series(cards.take(shuffler))
cards

0     K
1     A
2     1
3     Q
4     J
5     4
6     5
7     6
8     3
9     2
10    9
11    0
12    7
13    8
dtype: object

#### We have now shuffled the cards arrangement. The permutation method shuffles the 14 values (0 to 13 both inclusive) and the take method implies the arrangement of values in shuffler to indices of cards array. Hence the cards are shuffled.

## Thanks for reading.